api/app/controllers/api/events_controller.rb

SELECT `events`.`id`, `events`.`title`, `events`.`url`, `events`.`event_type`, `events`.`state`, `events`.`city`, `events`.`street`, `events`.`street_num`, `events`.`start_date_time`, `events`.`end_date_time`, `events`.`age_limit`, `events`.`privacy`, `events`.`croud_selection`, `events`.`body_heb`, `events`.`body_eng`, `events`.`allow_unauth`, `events`.`owner_id`, `events`.`event_password` FROM `events`
---
  def index
    render json: Event.select(:id, :title, :url, :event_type, :state, :city, :street, :street_num, :start_date_time, :end_date_time, :age_limit, :privacy, :croud_selection, :body_heb, :body_eng, :allow_unauth, :owner_id, :event_password)