api/app/controllers/api/managers_controller.rb

  def index
    render json: Manager.select(:id, :user_id, :event_id)
---
SELECT `managers`.`id`, `managers`.`user_id`, `managers`.`event_id` FROM `managers`