api/app/controllers/api/pages_controller.rb

  def index
    render json: Page.select(:id, :title, :allow_unauth)
---
SELECT `pages`.`id`, `pages`.`title`, `pages`.`allow_unauth` FROM `pages`