api/app/controllers/api/posts_controller.rb

  def index
    render json: Post.select(:id, :title, :body, :allow_unauth)
---
SELECT `posts`.`id`, `posts`.`title`, `posts`.`body`, `posts`.`allow_unauth` FROM `posts`