api/app/controllers/api/users_controller.rb

SELECT `users`.`id`, `users`.`first_name`, `users`.`last_name`, `users`.`official_id`, `users`.`age`, `users`.`ticket_token`, `users`.`role`, `users`.`phone`, `users`.`fb_profile_url`, `users`.`email`, `users`.`password_digest` FROM `users`
---
  def index
    render json: User.select(:id, :first_name, :last_name, :official_id, :age, :ticket_token, :role, :phone, :fb_profile_url, :email, :password_digest)